# Третє завдання (не обов'язкове)
#
#
#
# У вашій компанії ведеться активна маркетингова кампанія за допомогою SMS-розсилок. Для цього ви збираєте телефонні номери клієнтів із бази даних, але часто стикаєтеся з тим, що номери записані у різних форматах. Наприклад:
#
#
#
# "    +38(050)123-32-34"
# "     0503451234"
# "(050)8889900"
# "38050-111-22-22"
# "38050 111 22 11   "
#
#
#
# Ваш сервіс розсилок може ефективно відправляти повідомлення лише тоді, коли номери телефонів представлені у коректному форматі. Тому вам необхідна функція, яка автоматично нормалізує номери телефонів до потрібного формату, видаляючи всі зайві символи та додаючи міжнародний код країни, якщо потрібно.
#
#
#
# Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' на початку. Функція приймає один аргумент - рядок з телефонним номером у будь-якому форматі та перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. Якщо номер не містить міжнародного коду, функція автоматично додає код '+38' (для України). Це гарантує, що всі номери будуть придатними для відправлення SMS.

from re import sub

def normalize_phone(phone_number: str) -> str:
    phone = sub(r'\D', '', phone_number)
    return f'+38{phone}' if len(phone) == 10 else f"+{phone}"

print(normalize_phone('0503451234'))
print(normalize_phone('(050)8889900'))
print(normalize_phone('38050-111-22-22'))
print(normalize_phone('38050 111 22 11   '))
print(normalize_phone('+380501112222'))